# GetConduitSizesIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizes..::..GetConduitSizesIterator Method
ConduitSizes Class See Also
---
Returns a ConduitSizeIterator to the conduit sizes.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ConduitSizeIterator GetConduitSizesIterator()
```

Visual Basic
---
```text
Public Function GetConduitSizesIterator As ConduitSizeIterator
```

Visual C++
---
```text
public:
ConduitSizeIterator^ GetConduitSizesIterator()
```

# See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace